# Packages to install on any new machine to feel nice & cozy. At home if you will.
# docs: https://homebrew-file.readthedocs.io/en/latest/usage.html

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "autojump"
# bat: a cat clone with wings
# https://github.com/sharkdp/bat
brew "bat"
brew "ffmpeg"
brew "fzf"
brew "git"
# hyperfine: A command-line benchmarking tool.
# https://github.com/sharkdp/hyperfine
brew "hyperfine"
brew "jq"
brew "kubernetes-cli", link: false
brew "mysql"
brew "neovim"
brew "node"
brew "prettier"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxinator"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "tilt-dev/tap/tilt"
cask "alfred"
cask "bestres"
cask "camo-studio"
cask "firefox"
cask "insomnia"
cask "iterm2"
cask "plex"
cask "rectangle"
cask "swinsian"
cask "vlc"


# not sure of the origin of these packages
# including for posterity's sake
brew "glib"
brew "dockutil"
brew "guile"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "srt"

brew "gobject-introspection"
brew "nghttp2"
